{
    "id": 72,
    "description": "Given a path to a directory and a path to a json file, it recursively reads the contents of the directory and builds a dictionary to be saved in the json file. It returns the maximum number of files contained in one of the directories.",
    "text": "Design a function es72(dirname, jsonfile) such that:\n    - it is recursive or uses recursive functions(s)/method(s),\n    - it receives as arguments a directory pathname 'dirname' and a\n      file name 'jsonfile', and\n    - it builds a dictionary representing the structure of 'dirname'\n    - it saves the built dictionary as a Json file with name 'jsonfile' \n    - it returns the maximum number of files/directories contained in\n      one of the directories/subdirectories\n    All files and directories starting with '.' must be ignored.\n\n    The dictionary built by the function is defined as follows:\n    - for each file and subdirectory in a directory, the dictionary\n      has a key with the name of the file or subdirectory\n    - for each key, the related value:\n        - is the file size as an integer, if the key is a file;\n        - is the dictionary that represents the structure of that\n          directory, if the key is a directory.\n    The outermost dictionary only contains one key with 'dirname' and\n    the related value is the dictionary representing its structure.\n",
    
    "algorithm": "we declare a new function exploreDir(dir, name), which: \n\tgiven the path of a directory and the name of the directory \n\tinitialize an empty directory dictionary\n\t save the files of the directory in a file list\n\t save in the maximum variable the length of the file list\n\t for each file in files:\n\t\t construct the path of the file\n\t\t if the file is a directory: \n\t\t\tcall the function browseDir(...) on that directory, save the result back in d e m \n\t\t\t insert in dizio d for the key f \n\t\t\tupdate maximum, the max between maximum and m \n\t\totherwise: \n\t\t\t take the stats of the file \n\t\t\t save in dizio the value of the file size for the file key \n return dizio and maximum \n\n es72(...) \n\t call the function exploreDir(...) on the input directory and save the values returned in d and maximum \n\t write the dictionary in the json file \n return maximum",
    "tags": ["Recursion", "Dictionaries", "Files", "Json"],
    "effort": 6,
    "clues": [],
    "from": "esame-15-2-18"
}
